#
## tap
tap "homebrew/bundle" # brew bundle コマンド
tap "homebrew/cask" # GUI アプリのインストール
tap "homebrew/services" # brew service コマンド
tap "homebrew/cask-fonts" # フォント
tap "homebrew/cask-versions" # 異なるバージョンの cask
tap "oven-sh/bun" # bun: Jsのパッケージマネージャ

### Casks
cask "visual-studio-code" # 多機能テキストエディタ
cask "drawio" # drew io
cask "google-chrome" # google chrome
cask "discord"
cask "notion"
cask "steam"
cask "utm"
cask "antigravity"
cask "mactex-no-gui" # Tex Live
cask "font-hackgen" # プログラマ向けのフォント
cask "canva"
cask "microsoft-teams"
cask "figma"
cask "bfxr" # 効果音生成
cask "mark-text" # MDエディタ
cask "inkscape"
cask "obsidian"
cask "orbstack" # Docker Container のGUI管理ツール
cask "poppler"
cask "godot"
cask "affinity"

### Homebrew
brew "mas" # Mac App Store command-line interface
brew "ansible"
brew "nvim"
brew "w3m"
brew "gcc"
brew "pyenv"
brew "rust" #brew "rust" # Rust toolchain installer
brew "rust-analyzer" # Experimental Rust compiler front-end for IDEs
brew "nodebrew"
brew "virtualenv"
brew "tmux"
brew "rbenv"
brew "graphviz"
brew "cmake"
brew "make"
brew "uv"
brew "tree"
brew "translate-shell"
brew "node"
brew "anyenv"
brew "trash"
brew "nodenv"
brew "opencv"
brew "watchman"
brew "nvim"
brew "w3m"
brew "pipx"
brew "gcc"
brew "python-tk"
brew "pyenv"
brew "openjdk"
brew "yaml-cpp"
brew "googletest" # for C++ Test
brew "postgresql"
brew "python-setuptools"
brew "nvm"
brew "wget"
brew "p7zip"
brew "redis"
brew "wireshark"
brew "nmap"
brew "go"
brew "bun"
brew "poppler" # PDFをPNGに切り出して保存するなど

# For C++ API Framework "Dragon"
brew "jsoncpp"
brew "ossp-uuid"
brew "openssl"


### mas


